app/controllers/static_controller.rb

  def thank_you
    backer = Backer.find session[:thank_you_backer_id]
---
SELECT "backers".* FROM "backers" WHERE "backers"."id" = $1 LIMIT 1  [["id", 1]]